{
  "backend/main.mo": "Main Motoko actor for the Bevinamarada Ayurvedic Store backend, managing products, inquiries, sales, and user profiles with role-based access control. Provides CRUD operations, income statistics, stock management, and authorization checks.",
  "feature_evidence.json": "Feature evidence report listing four revert features (AdminDashboardPage, AdminSidebar, AdminProductsPage, and global CSS/Tailwind config) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions summarizing each page or config file's purpose and its pre-Version-2 restoration status.",
  "frontend/index.css": "Global Tailwind CSS entry file defining CSS custom property tokens for light and dark themes including colors, borders, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'Bevinamarada Ayurvedic Store' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that defines the TanStack Router route tree for both customer-facing pages and admin pages, including a redirect from /admin to /admin/dashboard.",
  "frontend/src/components/AdminSidebar.tsx": "Admin sidebar component with navigation links for Dashboard, Products, Sales & Income, and Enquiries, plus logout functionality and a mobile hamburger drawer.",
  "frontend/src/components/CustomerFooter.tsx": "Customer-facing footer component displaying store branding, contact info (phone, WhatsApp, address), and quick navigation links with Ayurvedic styling.",
  "frontend/src/components/CustomerHeader.tsx": "Sticky navigation header for the customer-facing site with a logo, desktop nav links, and a mobile hamburger menu. Active route highlighting is handled via TanStack Router's state.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using TanStack Query, returning either an authenticated or anonymous actor based on the current Internet Identity. Invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, exposing login/clear functions and status flags for Internet Identity authentication.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks (queries and mutations) for all backend operations including products, inquiries, sales, and admin checks, each delegating to the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind layers, defining an Ayurvedic-themed CSS custom property palette (greens, browns, gold, cream) and utility classes for gradients and textures.",
  "frontend/src/layouts/AdminLayout.tsx": "Layout wrapper for admin routes that redirects unauthenticated or non-admin users to the login page and renders the AdminSidebar alongside a nested Outlet when access is confirmed.",
  "frontend/src/layouts/CustomerLayout.tsx": "Simple layout wrapper for customer-facing pages that composes CustomerHeader, a flex-growing Outlet, and CustomerFooter.",
  "frontend/src/main.tsx": "Application entry point that mounts the React tree with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static About Us page displaying a hero section, store owner profile with credential tags, and a multi-paragraph store history narrative using Card and Separator UI components.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying store overview stats (income, products, inquiries, low stock) with stat cards, a low-stock threshold settings panel, and a refresh button.",
  "frontend/src/pages/AdminEnquiriesPage.tsx": "Admin page for managing customer inquiries, supporting mark-as-read and delete actions, with cards showing contact info, message, timestamp, and linked product name.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page using Internet Identity authentication, redirecting to the dashboard on successful admin verification and showing access-denied or error states otherwise.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin products management page with search, add/edit/delete dialogs, inline stock editing, and form validation for creating or updating product listings.",
  "frontend/src/pages/AdminSalesPage.tsx": "Admin sales page with tabs for daily, monthly, and per-product sales reports, plus a dialog to record new sales with product selection and quantity/price inputs.",
  "frontend/src/pages/ContactPage.tsx": "Contact page for the Ayurvedic store with a form to submit inquiries (name, phone, message, optional product) and contact info cards for phone, WhatsApp, address, and email.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero banner, up to 6 featured in-stock products, and call/WhatsApp action buttons for the Bevinamarada Ayurvedic Store.",
  "frontend/src/pages/ProductsPage.tsx": "Products listing page with search and category filter controls, displaying all non-hidden products in a responsive card grid with stock status badges.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom Ayurvedic color tokens, serif/sans font families, custom shadows, border radii, and animation keyframes, using typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 7) for the Bevinamarada Ayurvedic Store, including architectural notes, existing features, and a summary of the customer-facing website and admin dashboard requirements."
}